tests/6_Case_Type_Scatter_Height_20_Dist_20_dir_40_inprogress/30/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
    }

    // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions [0 1 -1 0 0 0 0];
#include "initialConditions";
internalField uniform $flowVelocity;
boundaryField
{
frontAndBack
    {
        type slip;
}
inlet
    {type    atmBoundaryLayerInletVelocity;
                #include "ABLConditions";
}

outlet
    {
        type inletOutlet;
        value $internalField;
        inletValue uniform (0 0 0);
    }
ground
    {
        type fixedValue;
        value uniform (0 0 0);
    }
ground_perim
    {
        type fixedValue;
        value uniform (0 0 0);
    }
building
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}

// ************************************************************************* //
