tests/6_Case_Type_Scatter_Height_20_Dist_20_dir_40_inprogress/30/system/decomposeParDict
// * * * * * * * * * //
            FoamFile
{
                version 0.5;
                format ascii;
                root "ROOT";
    case "CASE";

    class dictionary;
        object nix;
    }
    method scotch;
    numberOfSubdomains 16;
scotchCoeffs
{
}